FutureDesigns/uEZ/uEZ/Source/Devices/Touchscreen/Renesas/RX62N/RX62N_uEZGUI_TS.c
/*-------------------------------------------------------------------------*
 * File:  RX62N_uEZGUI_TS.c
 *-------------------------------------------------------------------------*
 * Description:
 *      Device implementation of the Four Wire Touchscreen interface.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <uEZ.h>
#include <Device/Touchscreen.h>
#include <HAL/HAL.h>
#include <HAL/GPIO.h>
#include <Types/ADC.h>
#include <Device/ADCBank.h>
#include "RX62N_uEZGUI_TS.h"
#include <uEZProcessor.h>
 
/*---------------------------------------------------------------------------*
 * Constants:
 *---------------------------------------------------------------------------*/
#ifndef NUM_CALIBRATE_POINTS_NEEDED
#define NUM_CALIBRATE_POINTS_NEEDED     3
#endif

#ifndef NUM_DUMMY_SAMPLES_PER_READING
#define NUM_DUMMY_SAMPLES_PER_READING   16
#endif

#ifndef NUM_SAMPLES_PER_READING
#define NUM_SAMPLES_PER_READING         32
#endif

#define COMPARE_LIMIT (64)



#define size_ra(ra) (sizeof(ra)/sizeof(ra[0]))


/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    const DEVICE_TOUCHSCREEN *iDevice;
    int aNumOpen;

    // Hardware linkage
    RX62N_uEZGUI_TS_Configuration iConfig;

    // Calibration information
    TBool iIsCalibrating;
    TUInt32 iNumCalibratePoints;
    T_uezTSReading iCalibrateReadingsTaken[NUM_CALIBRATE_POINTS_NEEDED];
    T_uezTSReading iCalibrateReadingsExpected[NUM_CALIBRATE_POINTS_NEEDED];

    TBool iHaveCalibration;

    TInt32 iPenOffsetX;
    TInt32 iPenBaseX;
    TInt32 iPenXScaleTop;
    TInt32 iPenXScaleBottom;

    TInt32 iPenOffsetY;
    TInt32 iPenBaseY;
    TInt32 iPenYScaleTop;
    TInt32 iPenYScaleBottom;

    T_uezSemaphore iSem;

    TUInt32 iTDSLow;
    TUInt32 iTDSHigh;
    TBool iTDSWasPressed;
} T_RX62N_uEZGUI_TS_Workspace;

#pragma bit_order left
#pragma unpack
struct st_dtc_xfer_full
{
  union
  {
    struct
    {
      unsigned long MRA_MD    :2;
      unsigned long MRA_SZ    :2;
      unsigned long MRA_SM    :2;
      unsigned long           :2;
      unsigned long MRB_CHNE  :1;
      unsigned long MRB_CHNS  :1;
      unsigned long MRB_DISEL :1;
      unsigned long MRB_DTS   :1;
      unsigned long MRB_DM    :2;
      unsigned long           :2;
      unsigned long           :16;
    }BIT;
    unsigned long LONG;
  }MR;
  void * SAR;
  void * DAR;
  struct
  {
    unsigned long CRA:16;
    unsigned long CRB:16;
  }CR;
};

struct st_dtc_xfer_short
{
  union
  {
    struct
    {
      unsigned long MRA_MD  :2;
      unsigned long MRA_SZ  :2;
      unsigned long MRA_SM  :2;
      unsigned long         :2;
      unsigned long SAR     :24;
    }BIT;
    unsigned long LONG;
  }SAR_MRA;
  union
  {
    struct
    {
      unsigned long MRB_CHNE  :1;
      unsigned long MRB_CHNS  :1;
      unsigned long MRB_DISEL :1;
      unsigned long MRB_DTS   :1;
      unsigned long MRB_DM    :2;
      unsigned long           :2;
      unsigned long DAR       :24;
    }BIT;
    unsigned long LONG;
  }DAR_MRB;
  struct
  {
    unsigned long CRA:16;
    unsigned long CRB:16;
  }CR;
};

#pragma bit_order
#pragma packoption

struct st_dtc_table
{
  union
  {
    struct
    {
      unsigned char MD  :2;
      unsigned char SZ  :2;
      unsigned char SM  :2;
      unsigned char     :2;
    }BIT;
    unsigned char BYTE;
  }MRA;
  union
  {
    struct
    {
      unsigned char CHNE  :1;
      unsigned char CHNS  :1;
      unsigned char DISEL :1;
      unsigned char DTS   :1;
      unsigned char DM    :2;
      unsigned char       :2;
    }BIT;
    unsigned char BYTE;
  }MRB;
  unsigned short dummy;
  unsigned long SAR;
  unsigned long DAR;
  unsigned short CRA;
  unsigned short CRB;
};

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
extern const DEVICE_TOUCHSCREEN RX62N_uEZGUI_TS_Interface;

#pragma section DTC_VECT
const unsigned long dtc_vectors = 0;    /* start of DTC vector table */
#pragma section
#pragma section DTC_TABLE
struct st_dtc_xfer_full ad_dtc_table;

#pragma section DTC_VECT_S12AD
const struct st_dtc_xfer_full *const ad_dtc_vector = &ad_dtc_table;

/* return to normal section definition */
#pragma section
TUInt16 AD_Buffer[8][8];         // allocate buffer for 8 samples on each A/D channel

void ad_dtc_init(void)
{
    memset(AD_Buffer, 0xCC, sizeof(AD_Buffer));
    
    /* configure A/D Converter */
    MSTP(S12AD) = 0;     /* enable A/D */
    S12AD.ADCSR.BIT.ADIE = 1; /* enable A/D to feed ICU */
    S12AD.ADCSR.BIT.ADCS = 1; /* continous scan */
    S12AD.ADCSR.BIT.CKS = 3; /* clock at pclk/1 */
    S12AD.ADANS.WORD = 0xFF;  /* enable sampling of all 8 channel */
    S12AD.ADADS.WORD = 0xFF;  /* enable multi-sample of all 8 channel */
    S12AD.ADADC.BYTE = 3;     /* configure for 4x addition */
    S12AD.ADCSR.BIT.ADST = 1; /* start conversions */

    ad_dtc_table.SAR = (void *)&S12AD.ADDRA;
    ad_dtc_table.DAR = AD_Buffer;
    ad_dtc_table.MR.LONG = 0;
    ad_dtc_table.MR.BIT.MRA_MD = 2;  // block transfer
    ad_dtc_table.MR.BIT.MRA_SZ = 1;  // long word transfer size (less bus cycles)
    ad_dtc_table.MR.BIT.MRA_SM = 2;  // increment source address
    ad_dtc_table.MR.BIT.MRB_DM = 2;  // increment destination address
    ad_dtc_table.MR.BIT.MRB_DTS = 1; // source side is block source
    ad_dtc_table.CR.CRA = 0x0808;            // 8 words (16 bytes) per transfer
    ad_dtc_table.CR.CRB = size_ra(AD_Buffer);  // number of block transfers

