FutureDesigns/uEZ/uEZ/Source/Devices/Touchscreen/Renesas/RX62N/RX62N_uEZGUI_TS.c
    S12AD.ADCSR.BIT.ADIE = 1;
    IEN(S12AD,ADI) = 1;
}

static void ad_dtc_acquire(void)
{
    ad_dtc_table.DAR = AD_Buffer;
    ad_dtc_table.CR.CRB = size_ra(AD_Buffer);  // number of block transfers
    IR(S12AD,ADI) = 0;
    DTCE(S12AD,ADI) = 1;
}

static TUInt16 ad_dtc_value(int channel)
{
    int index;
    TUInt32 value;

    if (channel >= size_ra(AD_Buffer[1]))
      return(0);

    /* sum values */
    for (index=0, value=0; index < size_ra(AD_Buffer); index++)
      value += AD_Buffer[index][channel];

    /* shift data */
    value /= 64;
    return ((TUInt16)value);
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_uEZGUI_TS_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup workspace for the TI TSC2046.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_uEZGUI_TS_InitializeWorkspace(void *aW)
{
    T_RX62N_uEZGUI_TS_Workspace *p = (T_RX62N_uEZGUI_TS_Workspace *)aW;
    return UEZSemaphoreCreateBinary(&p->iSem);
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_uEZGUI_TS_Open
 *---------------------------------------------------------------------------*
 * Description:
 *      The TI TSC2046 is being opened.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_uEZGUI_TS_Open(void *aW)
{
    T_RX62N_uEZGUI_TS_Workspace *p = (T_RX62N_uEZGUI_TS_Workspace *)aW;
    p->aNumOpen++;

    if (p->aNumOpen == 1) {
			
		(*p->iConfig.iXDrive.iGPIO)->Clear(
			p->iConfig.iXDrive.iGPIO,
			p->iConfig.iXDrive.iGPIOBit);
			
		(*p->iConfig.iXDrive.iGPIO)->SetOutputMode(
			p->iConfig.iXDrive.iGPIO,
			p->iConfig.iXDrive.iGPIOBit);
			
		(*p->iConfig.iYDrive.iGPIO)->Clear(
			p->iConfig.iYDrive.iGPIO,
			p->iConfig.iYDrive.iGPIOBit);
			
		(*p->iConfig.iYDrive.iGPIO)->SetOutputMode(
			p->iConfig.iYDrive.iGPIO,
			p->iConfig.iYDrive.iGPIOBit);
		
        /*PINo(OUT_TS_XR) = 0;
        PINo(OUT_TS_XL) = 0;
        PINo(OUT_TS_YU) = 0;
        PINo(OUT_TS_YL) = 0;
        DDRo(OUT_TS_XL);
        DDRo(OUT_TS_XR);
        DDRo(OUT_TS_YU);
        DDRo(OUT_TS_YL);*/
		
       	ad_dtc_init();
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_uEZGUI_TS_Close
 *---------------------------------------------------------------------------*
 * Description:
 *      The TI TSC2046 is being closed.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_uEZGUI_TS_Close(void *aW)
{
    T_RX62N_uEZGUI_TS_Workspace *p = (T_RX62N_uEZGUI_TS_Workspace *)aW;
    p->aNumOpen--;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_uEZGUI_TS_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      The SPI bus and GPIO device are being declared.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_uEZGUI_TS_Configure(
        T_uezDeviceWorkspace *aW,
        RX62N_uEZGUI_TS_Configuration *aConfig)
{
    T_RX62N_uEZGUI_TS_Workspace *p = (T_RX62N_uEZGUI_TS_Workspace *)aW;
    p->iConfig = *aConfig;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_uEZGUI_TS_ReadTouch
 *---------------------------------------------------------------------------*
 * Description:
 *      Read the X location being touched (if any)
 * Inputs:
 *      T_RX62N_uEZGUI_TS_Workspace *p    -- Workspace
 *      TUInt32 *aValue             -- Pointer to value read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_uEZGUI_TS_ReadTouch(
        T_RX62N_uEZGUI_TS_Workspace *p,
        TBool *aValue)
{
    TInt16 compare;

    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    ad_dtc_acquire();
    UEZTaskDelay(1);

    compare = (TInt16)ad_dtc_value(p->iConfig.iInputXL.iADCChannel) + (TInt16)ad_dtc_value(p->iConfig.iInputXR.iADCChannel);
    compare -= (TInt16)ad_dtc_value(p->iConfig.iInputYU.iADCChannel) + (TInt16)ad_dtc_value(p->iConfig.iInputYD.iADCChannel);
    compare = (compare >= 0)? compare:-compare;
    if (compare > COMPARE_LIMIT)
        *aValue = EFalse;
    else
        *aValue = ETrue;

    UEZSemaphoreRelease(p->iSem);
    return UEZ_ERROR_NONE;
}


/*---------------------------------------------------------------------------*
 * Routine:  RX62N_uEZGUI_TS_ReadX
 *---------------------------------------------------------------------------*
 * Description:
 *      Read the X location being touched (if any)
 * Inputs:
 *      T_RX62N_uEZGUI_TS_Workspace *p    -- Workspace
 *      TUInt32 *aValue             -- Pointer to value read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_uEZGUI_TS_ReadY(
        T_RX62N_uEZGUI_TS_Workspace *p,
        TUInt32 *aValue)
{
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // read axis values...even if not touched to keep timing consistant
    // Assert Y axis drivers
    (*p->iConfig.iYDrive.iGPIO)->Set(
		p->iConfig.iYDrive.iGPIO,
		p->iConfig.iYDrive.iGPIOBit);

    // Wait for inputs to settle
    UEZTaskDelay(1);

