FutureDesigns/uEZ/uEZ/Source/Devices/Touchscreen/Renesas/RX62N/RX62N_uEZGUI_TS.c
    // Read Y axis inputs
    ad_dtc_acquire();
    UEZTaskDelay(1);
    *aValue = (TInt16)ad_dtc_value(p->iConfig.iInputXL.iADCChannel) + (TInt16)ad_dtc_value(p->iConfig.iInputXR.iADCChannel);

    // de-assert Y axis drivers
    (*p->iConfig.iYDrive.iGPIO)->Clear(
		p->iConfig.iYDrive.iGPIO,
		p->iConfig.iYDrive.iGPIOBit);
      
    UEZTaskDelay(1);

    UEZSemaphoreRelease(p->iSem);
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_uEZGUI_TS_ReadY
 *---------------------------------------------------------------------------*
 * Description:
 *      Read the Y location being touched (if any)
 * Inputs:
 *      T_RX62N_uEZGUI_TS_Workspace *p    -- Workspace
 *      TUInt32 *aValue             -- Pointer to value read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_uEZGUI_TS_ReadX(
        T_RX62N_uEZGUI_TS_Workspace *p,
        TUInt32 *aValue)
{
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // Assert X axis drivers
    (*p->iConfig.iXDrive.iGPIO)->Set(
		p->iConfig.iXDrive.iGPIO,
		p->iConfig.iXDrive.iGPIOBit);

    // Wait for inputs to settle
    UEZTaskDelay(1);

    // Read X axis input
    ad_dtc_acquire();
    UEZTaskDelay(1);
    *aValue = (TInt16)ad_dtc_value(p->iConfig.iInputYU.iADCChannel) + (TInt16)ad_dtc_value(p->iConfig.iInputYD.iADCChannel);

    // de-assert X axis drivers
    (*p->iConfig.iXDrive.iGPIO)->Clear(
		p->iConfig.iXDrive.iGPIO,
		p->iConfig.iXDrive.iGPIOBit);

    // Wait for inputs to settle
    UEZTaskDelay(1);

    UEZSemaphoreRelease(p->iSem);
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_uEZGUI_TS_ApplyCalibration
 *---------------------------------------------------------------------------*
 * Description:
 *      Given the x, y raw coordinates, calculate the proper x, y
 *      calibrated coordinates.
 * Inputs:
 *      T_RX62N_uEZGUI_TS_Workspace *p    -- Workspace
 *      TUInt32 x, y                -- Raw x, y values
 *      TUInt32 *newX, *newY        -- Pointer to calibrated x, y values
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static void RX62N_uEZGUI_TS_ApplyCalibration(
        T_RX62N_uEZGUI_TS_Workspace *p,
        TUInt32 x,
        TUInt32 y,
        TUInt32 *newX,
        TUInt32 *newY)
{
    TInt32 v;

    v = x - p->iPenOffsetX;
    v *= p->iPenXScaleTop;
    v /= p->iPenXScaleBottom;
    v += p->iPenBaseX;
    *newX = (TUInt32)v;

    v = y - p->iPenOffsetY;
    v *= p->iPenYScaleTop;
    v /= p->iPenYScaleBottom;
    v += p->iPenBaseY;
    *newY = (TUInt32)v;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_uEZGUI_TS_Poll
 *---------------------------------------------------------------------------*
 * Description:
 *      Take a reading from the TSC2406 and put in reading structure.
 * Inputs:
 *      void *aW                    -- Workspace
 *      T_uezTSReading *aReading     -- Pointer to final reading
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_uEZGUI_TS_Poll(
        void *aWorkspace,
        T_uezTSReading *aReading)
{
    T_RX62N_uEZGUI_TS_Workspace *p = (T_RX62N_uEZGUI_TS_Workspace *)aWorkspace;
    T_uezError error;
    TUInt32 x, y;
    TBool isTouch, isTouch2;

    error = RX62N_uEZGUI_TS_ReadTouch(p, &isTouch);
    if (error)
        return error;

    error = RX62N_uEZGUI_TS_ReadX(p, (TUInt32 *)&aReading->iX);
    if (error)
        return error;

    error = RX62N_uEZGUI_TS_ReadY(p, (TUInt32 *)&aReading->iY);
    if (error)
        return error;

    // Make sure we are still touching
    error = RX62N_uEZGUI_TS_ReadTouch(p, &isTouch2);
    if (error)
        return error;

    x = aReading->iX;
    y = aReading->iY;

    if (!isTouch2)
        isTouch = EFalse;

    if (isTouch) {
        aReading->iFlags = TSFLAG_PEN_DOWN;

        if ((!p->iIsCalibrating) && (p->iHaveCalibration)) {
            // Convert X & Y coordinates
            RX62N_uEZGUI_TS_ApplyCalibration(p, x, y, (TUInt32 *)&aReading->iX, (TUInt32 *)&aReading->iY);
        }
    } else {
        // Pen is not down
        aReading->iFlags = 0;
    }

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_uEZGUI_TS_CalibrateStart
 *---------------------------------------------------------------------------*
 * Description:
 *      Start calibration mode.  All readings will now report raw data.
 * Inputs:
 *      void *aW                    -- Workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_uEZGUI_TS_CalibrateStart(void *aWorkspace)
{
    T_RX62N_uEZGUI_TS_Workspace *p = (T_RX62N_uEZGUI_TS_Workspace *)aWorkspace;

    p->iIsCalibrating = ETrue;
    p->iNumCalibratePoints = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_uEZGUI_TS_CalibrateEnd
 *---------------------------------------------------------------------------*
 * Description:
 *      Calibration is complete.  Compute the calibration matrix and use.
 * Inputs:
 *      void *aW                    -- Workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *                                      Return ERROR_OUT_OF_RANGE if
 *                                      calibration is bad.  Returns
 *                                      UEZ_ERROR_NOT_ENOUGH_DATA if not
 *                                      enough data points were added.
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_uEZGUI_TS_CalibrateEnd(void *aWorkspace)
{
    TUInt32 minIX, maxIX, minOX, maxOX;
    TUInt32 minIY, maxIY, minOY, maxOY;
    TUInt32 i;

    T_RX62N_uEZGUI_TS_Workspace *p = (T_RX62N_uEZGUI_TS_Workspace *)aWorkspace;

