FutureDesigns/uEZ/uEZ/Source/Devices/Touchscreen/Renesas/RX62N/RX62N_uEZGUI_TS.c
    p->iIsCalibrating = EFalse;

    if (p->iNumCalibratePoints == NUM_CALIBRATE_POINTS_NEEDED)  {
        // Do the calibration algorithm here
        minIX = minOX = minIY = minOY = 0xFFFFFFFF;
        maxIX = maxOX = maxIY = maxOY = 0;

        for (i=0; i<p->iNumCalibratePoints; i++)  {

            // Find range of inputs
            if (p->iCalibrateReadingsTaken[i].iX < minIX) {
                minIX = p->iCalibrateReadingsTaken[i].iX;
                minOX = p->iCalibrateReadingsExpected[i].iX;
            }
            if (p->iCalibrateReadingsTaken[i].iX > maxIX) {
                maxIX = p->iCalibrateReadingsTaken[i].iX;
                maxOX = p->iCalibrateReadingsExpected[i].iX;
            }
            if (p->iCalibrateReadingsTaken[i].iY < minIY) {
                minIY = p->iCalibrateReadingsTaken[i].iY;
                minOY = p->iCalibrateReadingsExpected[i].iY;
            }
            if (p->iCalibrateReadingsTaken[i].iY > maxIY) {
                maxIY = p->iCalibrateReadingsTaken[i].iY;
                maxOY = p->iCalibrateReadingsExpected[i].iY;
            }
        }

        // Find scale factor of X
        p->iPenOffsetX = minIX;
        p->iPenBaseX = minOX;
        p->iPenXScaleTop = maxOX - minOX;
        p->iPenXScaleBottom = maxIX - minIX;

        // Find scale factor of Y
        p->iPenOffsetY = minIY;
        p->iPenBaseY = minOY;
        p->iPenYScaleTop = maxOY - minOY;
        p->iPenYScaleBottom = maxIY - minIY;

        p->iHaveCalibration = ETrue;

    } else {
        return UEZ_ERROR_NOT_ENOUGH_DATA;
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_uEZGUI_TS_CalibrateAdd
 *---------------------------------------------------------------------------*
 * Description:
 *      Add a calibration point to the calibration data.
 * Inputs:
 *      void *aW                    -- Workspace
 *      const T_uezTSReading *aReadingTaken -- Raw reading values
 *      const T_uezTSReading *aReadingExpected -- Expected output reading
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_uEZGUI_TS_CalibrateAdd(
        void *aWorkspace,
        const T_uezTSReading *aReadingTaken,
        const T_uezTSReading *aReadingExpected)
{
    T_RX62N_uEZGUI_TS_Workspace *p = (T_RX62N_uEZGUI_TS_Workspace *)aWorkspace;
    TUInt32 num;

    num = p->iNumCalibratePoints;
    if (num < NUM_CALIBRATE_POINTS_NEEDED)  {
        p->iCalibrateReadingsTaken[num] = *aReadingTaken;
        p->iCalibrateReadingsExpected[num] = *aReadingExpected;
        p->iNumCalibratePoints++;
    } else {
        return UEZ_ERROR_OVERFLOW;
    }

    // Report an error if there is not enough data
    if (p->iNumCalibratePoints < NUM_CALIBRATE_POINTS_NEEDED)
        return UEZ_ERROR_NOT_ENOUGH_DATA;

    // Got enough, good.
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_uEZGUI_TS_SetTouchDetectSensitivity
 *---------------------------------------------------------------------------*
 * Description:
 *      Sets the touch sensitivity for detecting a touch on the screen.
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt16 aLowLevel           -- 16-bit low level.  0xFFFF is full 100%
 *                                      sensitivity, 0 is no sensitivity.
 *      TUInt16 aHighLevel          -- 16-bit high level.  0xFFFF is no (0%)
 *                                      sensitivity, 0xFFFF is no sensitivity.
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_uEZGUI_TS_SetTouchDetectSensitivity(
        void *aWorkspace,
        TUInt16 aLowLevel,
        TUInt16 aHighLevel)
{
    T_RX62N_uEZGUI_TS_Workspace *p = (T_RX62N_uEZGUI_TS_Workspace *)aWorkspace;

    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    // Shift down the sensitivity to be a 10 bit reading
    // then multiply by the number of readings.
    p->iTDSLow = (aLowLevel>>6)*NUM_SAMPLES_PER_READING;
    p->iTDSHigh = (aHighLevel>>6)*NUM_SAMPLES_PER_READING;
    UEZSemaphoreRelease(p->iSem);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Device Interface table:
 *---------------------------------------------------------------------------*/
const DEVICE_TOUCHSCREEN Touchscreen_DirectDrive_Interface = {
    {
        // Common interface
        "Touchscreen:Generic:4Wire",
        0x0105,
        RX62N_uEZGUI_TS_InitializeWorkspace,
        sizeof(T_RX62N_uEZGUI_TS_Workspace),
    },

    // Functions
    RX62N_uEZGUI_TS_Open,
    RX62N_uEZGUI_TS_Close,
    RX62N_uEZGUI_TS_Poll,

    RX62N_uEZGUI_TS_CalibrateStart,
    RX62N_uEZGUI_TS_CalibrateAdd,
    RX62N_uEZGUI_TS_CalibrateEnd,

    RX62N_uEZGUI_TS_SetTouchDetectSensitivity,
};

/*-------------------------------------------------------------------------*
 * End of File:  RX62N_uEZGUI_TS.c
 *-------------------------------------------------------------------------*/
